### Report for deductions-cross-account

#### Terraform Initialization ⚙️`success`
<details><summary>Initialization Output</summary>

```

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
- ci_roles in iam-ci
- environment_roles in iam-environment
- environment_strict_roles in iam-strict-environment
Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 3.0"...
- Installing hashicorp/aws v3.76.1...
- Installed hashicorp/aws v3.76.1 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan (5 to add, 14 to change, 0 to destroy)</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_ecr_repository.ehr-repo will be updated in-place
  ~ resource "aws_ecr_repository" "ehr-repo" {
        id                   = "deductions/ehr-repo"
        name                 = "deductions/ehr-repo"
      ~ tags                 = {
          ~ "CreatedBy" = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
        }
      ~ tags_all             = {
          ~ "CreatedBy" = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_ecr_repository.ehr-transfer-service will be updated in-place
  ~ resource "aws_ecr_repository" "ehr-transfer-service" {
        id                   = "deductions/ehr-transfer-service"
        name                 = "deductions/ehr-transfer-service"
      ~ tags                 = {
          ~ "CreatedBy" = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
        }
      ~ tags_all             = {
          ~ "CreatedBy" = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_ecr_repository.ehr_out_service will be updated in-place
  ~ resource "aws_ecr_repository" "ehr_out_service" {
        id                   = "deductions/ehr-out-service"
        name                 = "deductions/ehr-out-service"
      ~ tags                 = {
          ~ "CreatedBy" = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
        }
      ~ tags_all             = {
          ~ "CreatedBy" = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_ecr_repository.gp2gp-adaptor will be updated in-place
  ~ resource "aws_ecr_repository" "gp2gp-adaptor" {
        id                   = "deductions/gp2gp-adaptor"
        name                 = "deductions/gp2gp-adaptor"
      ~ tags                 = {
          ~ "CreatedBy" = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
        }
      ~ tags_all             = {
          ~ "CreatedBy" = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_ecr_repository.gp2gp-messenger will be updated in-place
  ~ resource "aws_ecr_repository" "gp2gp-messenger" {
        id                   = "deductions/gp2gp-messenger"
        name                 = "deductions/gp2gp-messenger"
      ~ tags                 = {
          ~ "CreatedBy" = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
        }
      ~ tags_all             = {
          ~ "CreatedBy" = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_ecr_repository.gp_registrations_mi_forwarder will be updated in-place
  ~ resource "aws_ecr_repository" "gp_registrations_mi_forwarder" {
        id                   = "repo/gp-registrations-mi-forwarder"
        name                 = "repo/gp-registrations-mi-forwarder"
      ~ tags                 = {
          ~ "CreatedBy" = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
        }
      ~ tags_all             = {
          ~ "CreatedBy" = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_ecr_repository.mesh-forwarder will be updated in-place
  ~ resource "aws_ecr_repository" "mesh-forwarder" {
        id                   = "deductions/mesh-forwarder"
        name                 = "deductions/mesh-forwarder"
      ~ tags                 = {
          ~ "CreatedBy" = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
        }
      ~ tags_all             = {
          ~ "CreatedBy" = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_ecr_repository.mhs-inbound will be updated in-place
  ~ resource "aws_ecr_repository" "mhs-inbound" {
        id                   = "mhs-inbound"
        name                 = "mhs-inbound"
      ~ tags                 = {
          ~ "CreatedBy" = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
        }
      ~ tags_all             = {
          ~ "CreatedBy" = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_ecr_repository.mhs-outbound will be updated in-place
  ~ resource "aws_ecr_repository" "mhs-outbound" {
        id                   = "mhs-outbound"
        name                 = "mhs-outbound"
      ~ tags                 = {
          ~ "CreatedBy" = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
        }
      ~ tags_all             = {
          ~ "CreatedBy" = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_ecr_repository.nems-event-processor will be updated in-place
  ~ resource "aws_ecr_repository" "nems-event-processor" {
        id                   = "deductions/nems-event-processor"
        name                 = "deductions/nems-event-processor"
      ~ tags                 = {
          ~ "CreatedBy" = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
        }
      ~ tags_all             = {
          ~ "CreatedBy" = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_ecr_repository.nia_mhs_inbound will be created
  + resource "aws_ecr_repository" "nia_mhs_inbound" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "docker-hub/nhsdev/nia-mhs-inbound"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "CreatedBy" = "orphaned-record-continuity-infrastructure"
        }
      + tags_all             = {
          + "CreatedBy" = "orphaned-record-continuity-infrastructure"
        }
    }

  # aws_ecr_repository.nia_mhs_outbound will be created
  + resource "aws_ecr_repository" "nia_mhs_outbound" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "docker-hub/nhsdev/nia-mhs-outbound"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "CreatedBy" = "orphaned-record-continuity-infrastructure"
        }
      + tags_all             = {
          + "CreatedBy" = "orphaned-record-continuity-infrastructure"
        }
    }

  # aws_ecr_repository.pds-fhir-stub will be updated in-place
  ~ resource "aws_ecr_repository" "pds-fhir-stub" {
        id                   = "repo/pds-fhir-stub"
        name                 = "repo/pds-fhir-stub"
      ~ tags                 = {
          ~ "CreatedBy" = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
        }
      ~ tags_all             = {
          ~ "CreatedBy" = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_ecr_repository.pds_adaptor will be updated in-place
  ~ resource "aws_ecr_repository" "pds_adaptor" {
        id                   = "deductions/pds-adaptor"
        name                 = "deductions/pds-adaptor"
      ~ tags                 = {
          ~ "CreatedBy" = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
        }
      ~ tags_all             = {
          ~ "CreatedBy" = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_ecr_repository.re_registration_service will be updated in-place
  ~ resource "aws_ecr_repository" "re_registration_service" {
        id                   = "repo/re-registration-service"
        name                 = "repo/re-registration-service"
      ~ tags                 = {
          ~ "CreatedBy" = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
        }
      ~ tags_all             = {
          ~ "CreatedBy" = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_ecr_repository.suspension-service will be updated in-place
  ~ resource "aws_ecr_repository" "suspension-service" {
        id                   = "repo/suspension-service"
        name                 = "repo/suspension-service"
      ~ tags                 = {
          ~ "CreatedBy" = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
        }
      ~ tags_all             = {
          ~ "CreatedBy" = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_secretsmanager_secret.dockerhub_ecr_ptc will be created
  + resource "aws_secretsmanager_secret" "dockerhub_ecr_ptc" {
      + arn                            = (known after apply)
      + description                    = "Docker Hub creds for ECR pull-through cache"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "ecr-pullthroughcache/dockerhub"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = (known after apply)

      + replica (known after apply)

      + rotation_rules (known after apply)
    }

  # aws_secretsmanager_secret_policy.dockerhub_ecr_ptc will be created
  + resource "aws_secretsmanager_secret_policy" "dockerhub_ecr_ptc" {
      + id         = (known after apply)
      + policy     = (known after apply)
      + secret_arn = (known after apply)
    }

  # aws_secretsmanager_secret_version.dockerhub_ecr_ptc will be created
  + resource "aws_secretsmanager_secret_version" "dockerhub_ecr_ptc" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

Plan: 5 to add, 14 to change, 0 to destroy.
```

</details>